; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared0 - mode
	image1 - mode
	spectrograph2 - mode
	Star1 - direction
	GroundStation6 - direction
	GroundStation12 - direction
	Star5 - direction
	Star13 - direction
	Star0 - direction
	Star2 - direction
	GroundStation4 - direction
	Star7 - direction
	GroundStation9 - direction
	Star14 - direction
	GroundStation3 - direction
	Star8 - direction
	GroundStation11 - direction
	GroundStation10 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star5)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star13)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation11)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star14)
	(calibration_target instrument6 GroundStation11)
	(calibration_target instrument6 GroundStation9)
	(supports instrument7 spectrograph2)
	(supports instrument7 image1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation10)
	(calibration_target instrument7 GroundStation11)
	(calibration_target instrument7 Star8)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation6)
)
(:goal (and
	(pointing satellite0 Phenomenon15)
	(pointing satellite1 Star2)
	(have_image Phenomenon15 image1)
	(have_image Planet16 infrared0)
))

)

; plan
1. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 4
4. (turn_to satellite0 planet16 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet16)
   goals met: 0 of 4
5. (take_image satellite0 planet16 instrument0 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 1 of 4
6. (turn_to satellite0 phenomenon15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 4
7. (take_image satellite0 phenomenon15 instrument0 image1)
   added: (have_image phenomenon15 image1)
   goals met: 3 of 4
8. (turn_to satellite1 star2 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star2)
   goals met: 4 of 4
